Repository: FlipByBlink/PlainShogi
Catalog: Shared/サポートファイル/ローカリゼーション/Localizable.xcstrings
Source language: ja
Languages: en

source: ・SharePlay ・セリフ体フォントオプション ・テキスト連携機能
en: ・SharePlay ・Serif font ・Text import/export

source: ・SharePlay ・セリフ体フォントオプション ・駒のサイズオプション ・画像書き出し機能 ・テキスト書き出し/読み込み機能
en: ・SharePlay ・Serif font ・Font size ・Image export ・Text import/export

source: !想定外!
en: !ERROR!

source: "FaceTime App でSharePlayを使用すると、友達や家族とのFaceTime通話中にテレビ番組、映画、ミュージックを同期した状態でストリーム再生することができます。通話に参加しているほかの人とリアルタイムにつながって楽しみましょう。再生が同期され、コントロールが共有されるため、同時に同じ瞬間を見たり聞いたりできます。"
en: "With SharePlay in the FaceTime app, you can stream TV shows, movies, and music in sync with friends and family while on a FaceTime call together. Enjoy a real-time connection with others on the call—with synced playback and shared controls, you see and hear the same moments at the same time."

source: "SharePlayは、FaceTime通話中にほかのAppでも使用できます。"
en: "SharePlay can also be used in other apps during a FaceTime call."

source: **以下の項目はユーザー間で同期されません** ・各種オプション(上下反転/セリフ体/太字/駒のサイズ/English表記/強調表示常時オフ) ・駒増減モードに移行しているかどうか ・選択中の駒の様子(駒の移動等を完了させたタイミングで操作結果が同期されます) ・ドラッグしている最中の駒の様子(ドラッグを完了させたタイミングで操作結果が同期されます)
en: **No sync between users** ・Options(Reverse vertically/Serif font/Bold weight/Font size/English term/Disable shift sign) ・On edit mode ・Selecting state ・Dragging state

source: ☖ Plain将棋盤
en: ☖ PlainShogiBoard

source: 2台のiPhoneの上部を近付けると「SharePlay」と書かれたボタンが表示されます。そのボタンを押すと「将棋盤」アクティビティを起動され、相手にアクティビティの招待を送ります。
en: When the tops of the two iPhones are brought close together, a button labeled "SharePlay" will appear. Pressing that button will activate the "Shogi Board" activity and send an invitation to your partner to participate in the activity.

source: App Storeリンク
en: App Store link

source: Apple IDに紐付いた連絡先を知らない場合は、同じジェスチャーをした際にNameDrop(連絡先を交換するための機能)が起動します。
en: If you do not know the partner's Apple ID contact information, NameDrop (a feature for exchanging contacts) will be activated.

source: Appleサポートサイトを開く
en: Open Apple support site

source: English表記
en: English term

source: FaceTime中にこのアプリを立ち上げると、アクティビティを起動することが出来ます。アクティビティを起動すると、通話相手のデバイスではSharePlay参加を促す通知が表示されます。
en: If you launch this application during FaceTime, you can start an activity. When you launch an activity, the caller's device will show a notification asking them to join SharePlay.

source: iCloudによって端末間でデータ(局面/履歴/ブックマーク)が同期されます
en: Sync data(Board/History/Bookmark) between devices by iCloud

source: iCloud同期は簡易的な用途を想定しています。「同時に起動している端末間での同期」といったリアルタイム性の高い用途は想定していません。
en: iCloud Sync is intended for casual use. It is not intended for real-time tasks such as "synchronization between devices running at the same time".

source: iOS 16 以降のデバイスでは、「メッセージ」アプリでもSharePlayを利用できます。「メッセージ」アプリで「将棋盤」アクティビティに招待された場合は、「メッセージ」アプリ上から参加してください。
en: On devices running iOS 16 or later, SharePlay is also available in "Messages" app. If you are invited to "Shogi board" activity in "Messages" app, please join the activity in "Messages" app.

source: iOS 17 以降の2台のiPhoneの上部を近付けるだけでSharePlayを開始できます。
en: SharePlay can be initiated by simply bringing the tops of two iPhones running iOS 17 or later into close proximity.

source: iOSアプリと異なり、watchOSアプリでは以下の機能を対応していません
en: Unlike the iOS version, the watchOS version does not support the following features

source: iOSアプリ等と異なり、Apple TVアプリでは以下の機能を対応していません
en: Unlike the iOS version, the Apple TV version does not support the following features

# iPhone, iPad, Apple Watch, Mac, Apple TV, Apple Vision Pro
source: iPhone、iPad、Apple Watch、 Mac、Apple TV、Apple Vision Pro向け
en: iPhone, iPad, Apple Watch, Mac, Apple TV, Apple Vision Pro

source: Plain将棋盤
en: PlainShogiBoard

source: SharePlayできます
en: SharePlay ready

source: SharePlayではユーザーのデバイス間で同期するすべてのセッションデータに対してエンドツーエンド暗号化が用いられます。アプリ開発者やAppleは、このデータの復号鍵を保持していません。つまり、SharePlay中に通信されるデータを第三者が確認する事はありません。
en: The Group Activities framework uses end-to-end encryption on all session data. Developer and Apple doesn’t have the keys to decrypt this data.

source: SharePlayについて
en: About SharePlay

source: SharePlayに参加する
en: Join SharePlay

source: SharePlayの準備をする
en: Prepare SharePlay

source: SharePlayメニュー
en: SharePlay menu

source: SharePlayメニューを表示
en: Prepare SharePlay

source: アクティビティ
en: Activity

source: アクティビティ「将棋盤」を起動する
en: Activate "Shogi board" activity

source: アクティビティから離脱しても、自分以外はアクティビティに参加したままです。
en: Even if you leave the activity, everyone remains in the activity except you.

source: アクティビティから離脱する
en: Leave the activity

source: アクティビティに参加しました
en: Joined activity

source: アクティビティを終了しますか？
en: Close the activity?

source: アクティビティを終了する
en: Close the activity

source: アクティビティを終了すると、全員がアクティビティから離脱します。
en: When you end the activity, everyone will leave the activity.

source: アプリについて
en: About

source: アプリのリンクを共有
en: Share App Store link

source: アプリを立ち上げるためのショートカット
en: Shortcut to launch the app

source: オプション
en: Option

source: オプション(共有相手との同期なし)
en: Option(No sync between users)

source: ガイド
en: Guide

source: カスタマイズ
en: Customize

source: キャンセル
en: Cancel

source: コピー
en: Copy

source: これまでの履歴を削除しました
en: Removed history

source: サイドバー呼び出しボタンを常に非表示
en: Always hide menu button

source: ショートカット
en: Shortcut

source: セリフ体
en: Serif font

source: データ管理
en: Data management

source: テキスト
en: Text

source: テキストとしてコピー
en: Copy as text

source: テキストとして共有
en: Share as text

source: テキストファイルを読み込む
en: Import a text file

source: テキストを局面としてペースト
en: Paste a text as shogi board

source: テキスト書き出し/読み込み機能
en: Text Export / Import

source: テキスト書き出し例
en: Example

source: テキスト機能
en: Plain text

source: ドラッグ&ドロップについて
en: Drag & Drop

source: なし
en: nothing

source: はい、アクティビティを終了します
en: Yes, close the activity.

source: はじめる
en: OK

source: はじめ方
en: How to start

source: フォーマットを指定
en: Format

source: ブックマーク
en: Bookmark

source: ブックマークに保存できる局面は1つだけです
en: 1 bookmark only.

source: ブックマークを表示
en: Show bookmark

source: プレーンテキストとして「コピー」
en: Copy as plain text

source: プレーンテキストを「貼り付け」して読み込む
en: Paste as plain text

source: メールアプリからフィードバックを送る
en: Feedback from mail app

source: メニュー
en: Menu

source: メニューボタンを長押しすると「初期化ボタン」や「一手戻すボタン」などを呼び出せます
en: Launch "Initialize Button" / "Modify Button" by long press Menu button

source: メニューを表示
en: Show menu

source: メニューを開く
en: Open menu

source: もし、このアプリでバグやクラッシュが発生した場合、以下のボタン(もしくはアドレス)からフィードバックを送るとアプリの改善に繋がります
en: If you encounter any bugs or crashes with this app, please send us your feedback to help us improve this app

source: 一手だけ戻す
en: Return 1 action

source: 一般のApple TVアプリ同様にゲームコントローラーでもこのアプリを操作できます
en: This app can be controlled with a game controller (as well as with other Apple TV apps)

source: 上下反転
en: Reverse vertically

source: 上下反転させる
en: Reverse vertically

source: 上下反転を元に戻す
en: Restore reverse

source: 不具合フィードバック
en: Bug feedback

source: 了解しました
en: OK

source: 事前準備完了
en: Prepared

source: 他のアプリからテキストを盤上にドロップして盤面を読み込めます。「☗」が先頭のテキストをドロップしてください。
en: Import shogi board by dropping export-text into shogi board. The text head is "☗".

source: 他のアプリとドラッグ&ドロップ
en: Drag & Drop

source: 先頭の文字が「☗」のテキストを読み込んでください
en: The text head is "☗"

source: 共有
en: Share

source: 共有ボタンを長押しするとフォーマットを指定できます
en: Select format by long press share button

source: 再開
en: Restart

source: 最大
en: Max

source: 削除
en: Remove

source: 効果音を無効
en: Disable sound effect

source: 参加中
en: joined

source: 友達が既に「将棋盤」アクティビティを起動している場合は、システム側のUIを操作してアクティビティに参加しましょう。
en: If your friend has already started a "Shogi board" activity, you can join the activity by manipulating the system-side UI.

source: 友達に「FaceTime」で通話をかけるか、もしくは「メッセージ」で連絡する
en: Call FaceTime, or Contact on "Message"

source: 友達に「FaceTime」通話をかける
en: Call FaceTime

source: 大
en: Large

source: 太字
en: Weight

source: 完了
en: Done

source: 将棋盤
en: Shogi board

source: 将棋盤をSharePlay
en: Shareplay shogi board

source: 小
en: Small

source: 履歴
en: History

source: 履歴を全て削除する
en: Erase history

source: 履歴を表示
en: Show history

source: 引用: Apple サポートサイト
en: Quote: Apple support site

source: 強調表示をクリア
en: Clear shift sign

source: 待機中
en: waiting

source: 復元
en: Restore

source: 成りますか？
en: Promotion?

source: 成る
en: Yes

source: 戻るボタンを押すとサイドバーを表示できます
en: Press the back button to show the sidebar

source: 手駒を整理する
en: Modify captured pieces

source: 招待された側は、上部のメニューの「開く」ボタンを押してください。本アプリが起動され、アクティビティに自動的に参加します。
en: The invited partner presses the "Open" button in the menu at the top. This application will be launched. The partner will be automatically joined to the activity.

source: 操作
en: Command

source: 操作した直後の駒の強調表示を常に無効
en: Always disable shift sign

source: 更にカスタマイズ
en: More

source: 概要
en: Description

source: 標準
en: Default

source: 注意事項
en: Notice

source: 無効
en: invalidated

source: 特にSharePlay中に発生した不具合について報告していただけるととても助かります
en: Especially the feedback on the issues that occurred during SharePlay would be very helpful

source: 状況
en: State

source: 玉側の手駒
en: Piece in hand

source: 王側の手駒
en: Piece in hand

source: 現在、%@人でSharePlay中
en: SharePlay is active (Number: %@)

source: 現在、友達と繋がっているようです。友達が立ち上げたアクティビティに参加するか、もしくは自分でアクティビティを起動しましょう。
en: You are currently connected to a friend. Join an activity launched by your friend OR launch an activity by yourself.

source: 現在、履歴はありません
en: Nothing

source: 現在の参加者数
en: Active participant

source: 現在の局面をブックマーク
en: Bookmark now

source: 画像
en: Image

source: 画像として共有
en: Share as image

source: 盤面テキスト
en: Board text

source: 盤面を共有
en: Share shogi board

source: 盤面を初期化
en: Initialize

source: 盤面画像
en: Board image

source: 直近の約30局面を履歴として保存します
en: Save 30 stages

source: 細かな使い方
en: More how to

source: 編集
en: Edit

source: 自分からSharePlayを開始する
en: Start SharePlay by oneself

source: 自分からSharePlayを開始する事もできます。アクティビティを起動したら友達にSharePlay参加を促しましょう。
en: You can also start SharePlay yourself. Once you have started an activity, encourage your friends to join SharePlay.

source: 補足
en: Note

source: 見た目
en: Customize

source: 見た目をカスタマイズ
en: Customize font

source: 読み込みに失敗しました
en: Failed

source: 選択ボタンを長押しすると「カーソルの枠線」を一時的に非表示にできます
en: Long press gesture to hide focus effect temporarily

source: 長押しして駒を持ち上げ、そのままスライドして移動させる
en: Long press a piece, move it

source: 閉じる
en: Dismiss

source: 駒のサイズ
en: Size

source: 駒の選択を解除
en: Unfocus

source: 駒を他のアプリへドラッグして盤面をテキストとして書き出せます。
en: Export shogi board as plain text by dropping a piece into other apps

source: 駒を増減
en: Modify mode

source: 駒を消したり増やしたりする
en: Modify pieces

source: 駒増減モード
en: Modify mode

source: 駒増減モードを開始
en: Modify mode
